{
  "documents": [
    "Fakultas Fakultas Ekonomi dan Bisnis. Sejarah: Fakultas Ekonomi dan Bisnis (FEB) Unismuh Makassar merupakan salah satu fakultas terbesar dengan kiprah lebih dari setengah abad, berperan dalam pengembangan ilmu ekonomi, bisnis, dan akuntansi berbasis nilai-nilai Islam.. Visi: Menjadi pusat pengembangan ilmu ekonomi, bisnis, dan akuntansi yang unggul, modern, dan Islami.. Misi: Menyelenggarakan pendidikan ekonomi, bisnis, dan akuntansi berbasis riset.; Mengembangkan penelitian dan publikasi ilmiah berstandar nasional maupun internasional.; Mengintegrasikan nilai-nilai Islam dalam pengembangan keilmuan.; Meningkatkan peran serta dalam pembangunan ekonomi dan bisnis masyarakat.",
    "Pimpinan Fakultas Ekonomi dan Bisnis: Dekan: Dr. Andi Jam'an, S.E., M.Si.. Wakil Dekan I: Agusdiwana Suarni, S.E., M.Acc. Wakil Dekan II: Dr. Muchriana Muchran, S.E., M.Si., Ak, CA. Wakil Dekan III: Abdul Muttalib, S.E., M.M. Wakil Dekan IV: Dr. Sulaeman Masnan, S.Pd.I., M.Pd.I",
    "Program Studi S-1 Manajemen di Fakultas Ekonomi dan Bisnis. Program studi yang fokus pada pengembangan keilmuan manajemen, kewirausahaan, dan strategi bisnis. Akreditasi: Unggul Fasilitas: Laboratorium Manajemen; Ruang diskusi & seminar; Akses jurnal internasional Visi: Menjadi program studi manajemen yang unggul, inovatif, dan Islami. Misi: Menyelenggarakan pendidikan manajemen berbasis riset.; Mengembangkan budaya wirausaha berbasis teknologi.; Mengintegrasikan nilai-nilai Islam dalam praktik bisnis.",
    "Program Studi S-1 Akuntansi di Fakultas Ekonomi dan Bisnis. Program studi akuntansi yang berfokus pada audit, perpajakan, dan sistem informasi akuntansi. Akreditasi: Baik Sekali Fasilitas: Laboratorium Akuntansi; Software akuntansi & perpajakan; Pusat pelatihan sertifikasi Visi: Menjadi program studi akuntansi unggul dan Islami. Misi: Meningkatkan mutu pendidikan akuntansi.; Menghasilkan lulusan yang profesional dan berintegritas.; Mengembangkan penelitian dan pengabdian masyarakat.",
    "Program Studi S-1 Ekonomi Pembangunan di Fakultas Ekonomi dan Bisnis. Fokus pada analisis kebijakan ekonomi, pembangunan daerah, dan isu makro ekonomi. Akreditasi: Unggul Fasilitas: Laboratorium Ekonomi; Kelas digital; Ruang seminar Visi: Menjadi pusat pengembangan ilmu ekonomi pembangunan yang unggul dan Islami. Misi: Meningkatkan kualitas pembelajaran berbasis riset.; Menghasilkan lulusan yang kompeten dalam analisis kebijakan ekonomi.",
    "Program Studi S-1 Ekonomi Islam di Fakultas Ekonomi dan Bisnis. Mempelajari teori dan praktik ekonomi berbasis syariah. Akreditasi: Unggul Fasilitas: Laboratorium Ekonomi Syariah; Pusat Kajian Ekonomi Islam Visi: Menjadi program studi ekonomi Islam yang unggul dan berdaya saing global. Misi: Mengintegrasikan ekonomi dengan nilai Islam.; Menghasilkan lulusan profesional di bidang ekonomi syariah.",
    "Program Studi D-3 Perpajakan di Fakultas Ekonomi dan Bisnis. Menyiapkan tenaga profesional bidang perpajakan. Akreditasi: Unggul Fasilitas: Laboratorium Perpajakan; Simulasi pajak online Visi: Menjadi program studi vokasi unggul dalam bidang perpajakan. Misi: Menghasilkan lulusan ahli perpajakan yang profesional.; Meningkatkan keterampilan praktis berbasis regulasi terbaru.",
    "Organisasi mahasiswa di Fakultas Ekonomi dan Bisnis: Himpunan Mahasiswa Manajemen, Himpunan Mahasiswa Akuntansi, Himpunan Mahasiswa Ekonomi Pembangunan, Himpunan Mahasiswa Ekonomi Islam, Himpunan Mahasiswa Perpajakan. Fungsi: Sebagai wadah pengembangan minat, bakat, dan potensi kepemimpinan mahasiswa FEB Unismuh Makassar.",
    "Pendidikan berbasis Islam di Fakultas Ekonomi dan Bisnis: Seluruh kegiatan akademik dan non-akademik di FEB Unismuh Makassar berlandaskan nilai-nilai Al-Islam dan Kemuhammadiyahan.",
    "Fakultas Fakultas Keguruan dan Ilmu Pendidikan (FKIP) Universitas Muhammadiyah Makassar. Sejarah: FKIP merupakan salah satu fakultas tertua di Unismuh Makassar. Berdiri sejak awal pendirian Universitas Muhammadiyah Makassar tahun 1963, FKIP menjadi cikal bakal penyelenggaraan pendidikan tinggi di lingkungan Muhammadiyah Sulawesi Selatan.. Visi: Pada tahun 2030 menjadi fakultas berkarakter Islami yang unggul dan terpercaya dalam pengembangan ilmu pendidikan dan keguruan melalui penguatan caturdharma perguruan tinggi.. Misi: Menyelenggarakan pembelajaran yang terintegrasi dengan Al-Islam dan Kemuhammadiyahan.; Mengembangkan pendidikan berbasis teknologi pada setiap program studi.; Menguatkan penelitian dan pengabdian masyarakat melalui kemitraan dengan berbagai pihak.; Meningkatkan kualitas sumber daya manusia melalui studi lanjut dan pelatihan.",
    "Pimpinan Fakultas Keguruan dan Ilmu Pendidikan (FKIP) Universitas Muhammadiyah Makassar: Dekan: Dr. H. Baharullah, M.Pd.. Wakil Dekan I: Dr. Andi Husniati, M.Pd. Wakil Dekan II: Dr. Tasrif Akib, S.Pd.,M.Pd. Wakil Dekan III: Dr. Muhammad Nawir, M.Pd. Wakil Dekan IV: Dr. Sam'un Mukramin, S.Pd., M.Pd",
    "Program Studi Pendidikan Bahasa & Sastra Indonesia di Fakultas Keguruan dan Ilmu Pendidikan (FKIP) Universitas Muhammadiyah Makassar. Prodi Pendidikan Bahasa dan Sastra Indonesia Fakultas Keguruan dan Ilmu Pendidikan Universitas Muhammadiyah Makassar memiliki komitmen untuk menghasilkan lulusan pendidikan dan pengajaran Bahasa dan sastra Indonesia yang memiliki karaker islami. Sarjana pendidikan Bahasa dan sastra Indonesia yang menguasai pembelajaran berbasis multimedia yang terintegritas pada ajaran al-islam kemuhammadiyahan. Adapun lulusan yang diharapkan menjadi guru Bahasa dan sastra indonesia yang profesional dengan memanfaatkan IPTEKS, menjadi peneliti dan pengabdian pada masyarakat dengan kajian teori pada bidang Bahasa dan sastra indonesia yang telah terimplementasikan. Selain itu, diharapkan lulusan yang memiliki jiwa entrepreneur dengan menerapkan konsep teori wirausaha Bahasa dan sastra Indonesia. Akreditasi: Unggul, SK: 2022 Visi: Menghasilkan lulusan unggul dan terpercaya dalam menerapkan pembelajaran Bahasa Indonesia, Ilmu bahasa, dan Sastra Berbasis Multimedia yang berkarakter Islami Misi: Menyelenggarakan pendidikan dan pengajaran Bahasa dan Sastra Indonesia yang terintegrasi dengan Al Islam Kemuhammadiyaan;; Menyelenggarakan proses pembelajaran berbasis multimedia dalam bidang pembelajaran bahasa dan sastra Indonesia;; Menyelenggarakan penelitian dan pengabdian kepada masyarakat dalam bidang pendidikan bahasa dan sastra Indonesia; Mengembangkan jaringan kerjasama dengan berbagai lembaga dalam negeri dan luar negeri untuk melaksanakan Catur Dharma Perguruan Tinggi",
    "Program Studi Pendidikan Bahasa Inggris di Fakultas Keguruan dan Ilmu Pendidikan (FKIP) Universitas Muhammadiyah Makassar. Program studi Pendidikan Bahasa Inggris FKIP Unismuh Makassar berdiri sejak 11 September 1993 melalui SK Kementerian Pendidikan dan Kebudayaan No. 528/DIKTI/Kep/1993. Bertujuan membentuk lulusan dengan kompetensi pedagogik, teknologi pendidikan, dan karakter Islami. Akreditasi: Unggul, SK: 2022 Fasilitas: Laboratorium Bahasa; Microteaching Laboratory; Computer Laboratory; Faculty Library; E-Books; E-Myths Visi: Menghasilkan pendidik Bahasa Inggris yang unggul secara nasional dan global, berbasis nilai Islami dan kompetensi profesional modern.",
    "Program Studi Pendidikan Matematika di Fakultas Keguruan dan Ilmu Pendidikan (FKIP) Universitas Muhammadiyah Makassar. Program Studi Pendidikan Matematika FKIP Unismuh Makassar didirikan tahun 1991 dan secara resmi terdaftar pada 11 September 1993 melalui SK Dirjen Dikti No. 528/Dikti/Kep/1993. Terakreditasi Unggul berdasarkan SK BAN-PT No. 2198/BAN-PT/Akred/S/VII/2017. Saat ini memiliki sekitar 454 mahasiswa dan 35 dosen. Akreditasi: Unggul, SK: 3509/SK/BAN-PT/Akred/S/IX/2019 Visi: Menjadi program studi yang unggul dalam merencanakan dan mengaplikasikan inovasi pembelajaran matematika, berjiwa entrepreneur dan berkarakter Islami. Misi: Menyelenggarakan pendidikan dan pengajaran matematika berbasis kompetensi yang terintegrasi dengan Al-Islam Kemuhammadiyahan serta menumbuhkan jiwa entrepreneur.; Melaksanakan riset dan publikasi ilmiah untuk mengembangkan program pembelajaran matematika yang inovatif.; Menjalin kerja sama kemitraan yang saling menguatkan dalam rangka pengabdian kepada masyarakat dan implementasi hasil riset.",
    "Program Studi Pendidikan Guru Sekolah Dasar (PGSD) di Fakultas Keguruan dan Ilmu Pendidikan (FKIP) Universitas Muhammadiyah Makassar. Prodi PGSD S-1 FKIP Unismuh Makassar mulai dibuka pada tahun akademik 2006/2007 berdasarkan SK Dikti No. 3338/D/T/2006 tanggal 1 September 2006. Awalnya diselenggarakan jenjang D2 sejak 1992 melalui Proyek Pemerintah, lalu mandiri tahun 2011 berdasarkan SK Depdiknas Dirjen Dikti No. 2347/D/T/2001. Akreditasi: A, SK: 4170/SK/BAN-PT/Akred/S/X/2019 Fasilitas: Ruang perkuliahan; Laboratorium IPA; Laboratorium Komputer; Laboratorium Microteaching Visi: Mewujudkan Program Studi Pendidikan Guru Sekolah Dasar di Kawasan Timur Indonesia yang berkualitas, profesional, unggul, dan Islami pada tahun 2024 dalam menyelenggarakan pendidikan guru sekolah dasar untuk menghasilkan lulusan yang memiliki kompetensi setara dengan Kualifikasi Level Enam KKNI. Misi: Meningkatkan pembinaan iman dan taqwa di kalangan civitas akademika maupun umat melalui suasana akademik yang Islami.; Menyelenggarakan pendidikan dan pengajaran dasar yang profesional, berkualitas, akuntabel, dan berkelanjutan, selaras dengan pembinaan iman dan taqwa.; Melibatkan prodi dalam peningkatan mutu pendidikan dasar melalui kegiatan penelitian.; Menguatkan pengabdian kepada masyarakat melalui kemitraan dengan lembaga pendidikan, instansi terkait, dan stakeholder lainnya.",
    "Program Studi Teknologi Pendidikan di Fakultas Keguruan dan Ilmu Pendidikan (FKIP) Universitas Muhammadiyah Makassar. Program Studi Teknologi Pendidikan FKIP Unismuh Makassar mengedepankan pengembangan literasi sosial dan penyesuaian realitas pendidikan berbasis teknologi. Akreditasi: Unggul, SK: 2024  Fasilitas: Laboratorium Microteaching; Laboratorium Komputer; Laboratorium Sinematografi; Laboratorium Fotografi; Laboratorium Multimedia; Laboratorium Podcast; Laboratorium Desain Grafis Visi: Mengembangkan Pembelajaran Inovatif Guna Menghasilkan Teknolog Pendidikan yang Unggul dan Berkarekter Islami",
    "Program Studi Pendidikan Biologi di Fakultas Keguruan dan Ilmu Pendidikan (FKIP) Universitas Muhammadiyah Makassar. Program Studi Pendidikan Biologi FKIP Unismuh Makassar diselenggarakan berdasarkan Keputusan Menteri Riset, Teknologi dan Pendidikan Tinggi Nomor 41/M/Kp/III/2015. Prodi ini dikelola oleh sebelas dosen tetap yayasan, satu staf SIMAK, dan satu karyawan staf, dengan total mahasiswa sebanyak 240. Akreditasi: Unggul, SK: 595/SK/LAMDIK/Ak/S/VI/2024 Visi: Menyelenggarakan Pendidikan Biologi yang Inovatif, Berwawasan Lingkungan, dan Terampil dalam Bidang Ecopreneur yang Berlandaskan Nilai-Nilai Keislaman. Misi: Menyelenggarakan pendidikan dan pengajaran yang berbasis pada perkembangan ilmu pengetahuan dan keislaman.; Melaksanakan penelitian di bidang biologi dan kependidikan biologi yang mendukung inovasi pembelajaran.; Menyelenggarakan pengabdian kepada masyarakat sebagai tindak lanjut hasil penelitian.; Membina Al-Islam dan Kemuhammadiyahan secara khusus dan terintegrasi dalam konten bidang.",
    "Program Studi Pendidikan Pancasila dan Kewarganegaraan di Fakultas Keguruan dan Ilmu Pendidikan (FKIP) Universitas Muhammadiyah Makassar. Program Studi PPKn FKIP Unismuh Makassar dibuka berdasarkan SK Mendikbud No. 174/E/O/2014 tentang izin penyelenggaraan. Prodi ini mengembangkan wawasan keilmuan Pancasila, kewarganegaraan, politik, hukum, serta komitmen moral dan religiusitas, dengan tujuan mencetak guru yang ‘smart and good citizens’. Akreditasi: Unggul, SK: 334/SK/LAMDIK/Ak/S/III/2024 Visi: Menjadi Program Studi yang kompetitif dalam menghasilkan tenaga pendidik dan ahli di bidang Pendidikan Pancasila dan Kewarganegaraan yang memiliki sikap cinta tanah air dan moderasi berbangsa dan beragama yang berakhlak Islami. Misi: Menyelenggarakan proses pembelajaran Pendidikan Pancasila & Kewarganegaraan yang inovatif dan terintegrasi dengan nilai-nilai Islam.; Mengembangkan penelitian yang berbasis pada kearifan lokal.; Meningkatkan pengabdian pada masyarakat dalam rangka penegakan hak dan kewajiban warga negara berdasarkan konstitusi.; Membangun manajemen program studi yang sehat melalui penguatan tata kelola transparan, kerjasama, dan pencitraan publik.",
    "Program Studi Pendidikan Guru Pendidikan Anak Usia Dini (PG-PAUD) di Fakultas Keguruan dan Ilmu Pendidikan (FKIP) Universitas Muhammadiyah Makassar. Prodi PG-PAUD FKIP Unismuh Makassar memadukan teknologi informasi dan komunikasi dalam pembelajaran yang inovatif sekaligus berlandaskan nilai-nilai Islam. Diketahui sebagai prodi pertama di FKIP Unismuh yang meluluskan mahasiswa tanpa skripsi berkat publikasi ilmiah di jurnal terakreditasi nasional Sinta 2. Akreditasi: Baik, SK: 9944/SK/BAN-PT/Ak.KP/S/I/2023 Visi: Menjadi garda terdepan dalam menghasilkan tenaga profesional PG-PAUD pada tahun 2024 yang menggabungkan keahlian teknologi dan nilai Islami. Misi: Menyelenggarakan pendidikan sesuai kompetensi PAUD berbasis keilmuan dan keislaman.; Melaksanakan penelitian untuk pengembangan keilmuan dan pengajaran PAUD.; Mengembangkan pengabdian kepada masyarakat guna meningkatkan profesionalisme tenaga pendidik.; Mengembangkan model pembelajaran kreatif dan inovatif berbasis TI, dengan lingkungan akademik Islami, termasuk kerjasama institusional.",
    "Program Studi Pendidikan Sosiologi di Fakultas Keguruan dan Ilmu Pendidikan (FKIP) Universitas Muhammadiyah Makassar. Program Studi Pendidikan Sosiologi FKIP Unismuh Makassar mengembangkan kurikulum yang berlandaskan falsafah perenialisme, esensialisme, progressivisme, dan rekonstruksionisme—dengan tujuan menyiapkan tenaga pendidik, peneliti sosial, dan pengabdi masyarakat yang berkompetensi serta berakhlak mulia. Akreditasi: Unggul, SK: 864/SK/LAMDIK/Ak/S/VIII/2024 Visi: Menjadi Program Studi Pendidikan Sosiologi yang unggul dan berkarakter Islami dalam bidang pendidikan, penelitian, dan pengabdian kepada masyarakat berbasis kearifan lokal, nasional, dan berdaya saing global pada tahun 2028. Misi: Menyiapkan tenaga pendidik profesional di bidang Pendidikan Sosiologi.; Menyelenggarakan pembelajaran berbasis kearifan lokal dan karakter Islami.; Melaksanakan penelitian pendidikan dan sosiologi yang inovatif.; Menguatkan pengabdian kepada masyarakat melalui kemitraan dengan lembaga terkait.; Menghasilkan produk pembelajaran dan publikasi ilmiah dalam bidang Pendidikan Sosiologi.",
    "Program Studi Pendidikan Fisika di Fakultas Keguruan dan Ilmu Pendidikan (FKIP) Universitas Muhammadiyah Makassar. Program Studi Pendidikan Fisika FKIP Unismuh Makassar unggul dalam integrasi teknologi digital dan inovasi pembelajaran fisika. Akreditasi: Unggul, SK: 203/SK/LAMDIK/Ak/S/II/2024 Visi: Menjadi prodi unggul dalam inovasi pembelajaran fisika berkarakter Islami.",
    "Program Studi Pendidikan Seni Rupa di Fakultas Keguruan dan Ilmu Pendidikan (FKIP) Universitas Muhammadiyah Makassar. Program Studi S1 Pendidikan Seni Rupa FKIP Unismuh Makassar didirikan tahun 2008 berdasarkan izin Dirjen Dikti No. 280/D/T/2008 pada 16 Januari 2008, dengan SK operasional pada Agustus 2008. Prodi ini bertujuan menghasilkan guru seni rupa dengan wawasan keilmuan seni rupa, praktik, evaluasi, kritik, serta kepribadian religius dan berintegritas moral. Akreditasi: Unggul, SK: 717/SK/LAMDIK/Ak/S/XI/2022 Fasilitas: Studio Gambar/Lukis; Studio Fotografi; Studio Patung; Studio Kriya (Logam dan Keramik); Seni Rupa Pertunjukan; Perpustakaan Prodi; Galeri Seni Rupa (Galeri Unismuh, Rumah Seni Kasumba, Etika Studio Arts Space, Rumata Arts Space) Visi: Menghasilkan tenaga pendidik seni rupa kreatif, inovatif, dinamis, dan mandiri yang berkarakter Islami serta berjiwa entrepreneurship. Misi: Penyelenggaraan pendidikan seni rupa yang berkarakter Islami.; Pengajaran yang mengembangkan teori-teori baru dalam merespon seni rupa mutakhir dan mendukung jiwa entrepreneur.; Pelaksanaan penelitian, pengabdian, dan publikasi yang dinamis, inovatif, dan berkelanjutan.; Kemitraan dengan lembaga pendidikan dan non-pendidikan untuk mendukung mutu lulusan.; Menghasilkan sarjana pendidikan yang humanis dan adaptif.",
    "Organisasi mahasiswa di Fakultas Keguruan dan Ilmu Pendidikan (FKIP) Universitas Muhammadiyah Makassar: HMJ Pendidikan Bahasa & Sastra Indonesia, HMJ Pendidikan Bahasa Inggris, HMJ Pendidikan Matematika, HMJ PGSD, HMJ Teknologi Pendidikan, HMJ Pendidikan Sosiologi, HMJ Pendidikan Fisika, HMJ Pendidikan Biologi, HMJ PPKn, HMJ PG-PAUD, HMJ Pendidikan Seni Rupa. Fungsi: Wadah pengembangan minat, bakat, kepemimpinan, dan keilmuan mahasiswa di tingkat program studi.",
    "Pendidikan berbasis Islam di Fakultas Keguruan dan Ilmu Pendidikan (FKIP) Universitas Muhammadiyah Makassar: Integrasi nilai-nilai Islami, Al-Islam, dan Kemuhammadiyahan dalam setiap aktivitas pendidikan, penelitian, dan pengabdian.",
    "Fakultas Fakultas Teknik UNISMUH. Sejarah: Fakultas Teknik UNISMUH berdiri sejak tahun 1987 ditandai dengan operasionalnya Program Studi Teknik Pengairan berdasarkan SK No 0628/O/1989. Pada tahun yang sama prodi ini mulai menerima mahasiswa baru. Sejak itu selama lebih dari 30 tahun fakultas ini telah mendidik tenaga teknik yang berkompetensi dan tersebar di berbagai daerah maupun internasional berkontribusi dalam pembangunan nasional.. Visi: Menjadi lembaga yang Islami unggul dalam bidang teknik dipercaya oleh masyarakat dan mandiri dalam pengelolaan administratif maupun akademik.. Misi: Meningkatkan keimanan dan ketaqwaan melalui pembinaan Al-Islam dan Kemuhammadiyahan; Menyelenggarakan pendidikan berkualitas; Melaksanakan penelitian inovatif dan berdaya saing; Mengadakan pengabdian masyarakat yang bermanfaat; Menjalin kemitraan nasional dan internasional; Menumbuhkan jiwa kewirausahaan di kalangan civitas akademika",
    "Pimpinan Fakultas Teknik UNISMUH: Dekan: Dr. Ir. Hj. Nurnawaty S.T. M.T. IPM. Wakil Dekan I: Ir. Muhammad Syafa'at S. Kuba S.T. M.T.. Wakil Dekan II: Dr. Ir. Andi Makbul Syamsuri S.T. M.T. IPM. Wakil Dekan III: Dr. Abd. Rahman Bahtiar S.Ag. M.A.",
    "Program Studi Teknik Pengairan di Fakultas Teknik UNISMUH. Program Studi Teknik Pengairan hadir sebagai pusat pendidikan, penelitian, dan pengabdian masyarakat yang berfokus pada pengelolaan sumber daya air secara berkelanjutan. Dengan berlandaskan nilai-nilai Islami, kami berkomitmen untuk mencetak lulusan yang profesional, berintegritas, dan memiliki keahlian dalam merancang, mengelola, serta mengoptimalkan pemanfaatan air demi kesejahteraan masyarakat dan kelestarian lingkungan. Melalui website resmi ini, kami berharap dapat menyajikan informasi yang transparan dan bermanfaat mengenai visi, misi, kurikulum, kegiatan akademik, penelitian, maupun berbagai prestasi yang diraih oleh mahasiswa dan dosen. Semoga keberadaan website ini menjadi sarana komunikasi yang efektif bagi mahasiswa, alumni, orang tua, mitra kerja, serta masyarakat luas dalam mendukung pengembangan ilmu dan teknologi di bidang teknik pengairan. Akhir kata, kami mengucapkan terima kasih atas perhatian, dukungan, dan sinergi dari semua pihak. Mari bersama-sama membangun Program Studi Teknik Pengairan Universitas Muhammadiyah Makassar menuju masa depan yang lebih maju, unggul, dan berdaya saing global. Akreditasi: Baik Sekali, SK: 2022 Fasilitas: Laboratorium Hidraulika; Laboratorium Hidrologi; Laboratorium Sumber Daya Air",
    "Program Studi Teknik Elektro di Fakultas Teknik UNISMUH. Program Studi Teknik Elektro Universitas Muhammadiyah Makassar adalah sebuah entitas akademis yang didirikan pada 24 Juni 2005 melalui Surat Keputusan Menteri Pendidikan dan Kebudayaan RI Nomor 1995/D/T/2005. Sebagai bagian integral dari Fakultas Teknik, prodi ini telah mengalami beberapa kali perubahan kurikulum untuk menjawab tuntutan zaman dan kebutuhan industri. Memperoleh akreditasi B pada tahun 2017 oleh BAN-PT, Program Studi Teknik Elektro Unismuh Makassar memiliki komitmen untuk memberikan pendidikan unggul di bidang energi terbarukan dengan fokus pada Teknologi Cerdas dan IoT (Internet of Things) yang bersifat slami, terpercaya, dan mandiri. Akreditasi: B, SK: 2021 Fasilitas: Laboratorium Elektronika; Laboratorium Sistem Tenaga; Laboratorium Kendali; Laboratorium Telekomunikasi Visi: Visi prodi ini adalah untuk mewujudkan keunggulan dalam bidang energi terbarukan, dan misinya mencakup peningkatan wawasan Al Islam Kemuhammadiyahan, peningkatan kualitas pembelajaran di bidang Teknik Listrik, Teknik Telekomunikasi, dan Teknik Komputer berbasis IoT, penelitian yang inovatif dan berdaya saing, pengembangan hasil penelitian melalui pengabdian kepada masyarakat, serta membangun kemitraan dengan alumni, lembaga pendidikan tinggi, dunia industri, pemerintah, dan lembaga masyarakat, baik di dalam maupun di luar negeri. Dengan demikian, Program Studi Teknik Elektro Unismuh Makassar bertujuan menjadi pusat pendidikan yang tidak hanya berfokus pada penguasaan keilmuan, tetapi juga pada pengembangan karakter dan kontribusi positif terhadap kemajuan teknologi dan masyarakat. Misi: Meningkatkan Wawasan Al Islam Kemuhammadiyahan; Meningkatkan kualitas pembelajaran kompetensi keilmuan di bidang Teknik Listrik, Teknik Telekomunikasi dan Teknik Komputer yang berbasis IoT.; Meningkatkan penelitian yang inovatif, unggul dan berdaya saing.; Mengembangkan dan mengaplikasikan hasil penelitian ke dalam bentuk pengabdian kepada masyarakat.; Mengembangkan kemitraan dan kerjasama dengan alumni, lembaga pendidikan tinggi lain, dunia industri, pemerintah dan lembaga masyarakat baik di dalam negeri maupun di luar negeri.",
    "Program Studi Arsitektur di Fakultas Teknik UNISMUH. Program Studi Arsitektur melalui surat keputusan Menteri Pendidikan dan Kebudayaan RI Nomor 458/E/O/2014 pada tanggal 07 Oktober 2014 tentang Ijin Penyelenggaraan Program Studi  Arsitektur Unismuh Makassar, resmi membuka penerimaan mahasiswa baru dan memulai aktivitas perkuliahan pada Tahun Akademik 2015/2016 dengan berpedoman pada Permenristekdikti No.49 tahun 2014. Akreditasi: Unggul, SK: 2023 Fasilitas: Laboratorium Desain Arsitektur; Laboratorium Komputasi Arsitektur; Laboratorium Material dan Konstruksi Visi: Visi Program Studi Arsitektur. yaitu “Menjadi Program Studi yang Unggul, Terpercaya, dan Mandiri di bidang Perancangan Arsitektur yang berwawasan Humanis, Berkelanjutan, dan Islami pada Tahun 2028 ”. Misi: Menyelenggarakan pendidikan dan pengajaran yang unggul dalam perancangan Arsitektur Humanis dan Berkelanjutan yang berlandaskan nilai-nilai Islami melalui desain inklusif yang berwawasan sains dan teknologi;; Melaksanakan penelitian berwawasan arsitektur humanis, berkelanjutan yang berlandaskan nilai-nilai Islami dengan pendekatan sains dan teknologi; Melaksanakan pengabdian kepada masyarakat pada bidang Arsitektur yang terpercaya, memiliki kemandirian, dan menjunjung tinggi nilai-nilai islami, kemanusiaan, dan keberlanjutan.; Menyelenggarakan pembinaan Al Islam dan Kemuhammadiyahan kepada civitas akademika melalui pendidikan, penelitian dan pengabdian kepada masyarakat secara berkesinambungan.; Menumbuhkembangkan jiwa kewirausahaan bagi civitas akademika dan alumni.",
    "Program Studi Informatika di Fakultas Teknik UNISMUH. Program Studi Informatika adalah prodi yang berfokus pada teknologi informasi, pemrograman, jaringan komputer, spesialisasi dalam kecerdasan buatan dan juga pengembangan perangkat lunak berbasis web. Program Studi Informatika hadir sebagai wadah pendidikan, penelitian, dan pengabdian masyarakat di bidang ilmu komputer serta teknologi informasi, dengan berlandaskan nilai-nilai Islami. Kami berkomitmen untuk menghasilkan lulusan yang tidak hanya kompeten secara akademik dan profesional, tetapi juga berakhlak mulia, inovatif, serta mampu menjawab tantangan di era digital yang semakin dinamis. Melalui website resmi ini, kami berharap dapat memberikan informasi yang lengkap dan transparan mengenai visi, misi, kurikulum, kegiatan akademik, maupun berbagai prestasi mahasiswa dan dosen. Semoga website ini dapat menjadi sarana komunikasi yang bermanfaat bagi mahasiswa, alumni, orang tua, mitra industri, serta masyarakat luas. Akhir kata, kami mengucapkan terima kasih atas perhatian dan dukungan semua pihak. Mari kita bersama-sama membangun Program Studi Informatika Universitas Muhammadiyah Makassar menjadi lebih maju dan berdaya saing global. Akreditasi: Baik, SK: 2023 Fasilitas: Laboratorium Pemrograman; Laboratorium Jaringan Komputer; Laboratorium Kecerdasan Buatan Visi: Menjadi Pusat Pengembangan Studi Informatika dalam Bidang Kecerdasan Buatan yang Islami, Unggul, Mandiri dan Terpercaya Misi: Melaksanakan pendidikan dan pengajaran keilmuan Informatika yang professional dalam bidang kecerdasan buatan yang berjiwa wirausaha dan berwawasan Al Islami Kemuhammadiyahan.; Melaksanakan penelitian pada bidang kecerdasan buatan dalam peningkatan kualitas artikel ilmiah di tingkat nasional maupun internasional.; Melaksanakan pengabdian kepada masyarakat melalui pemberdayaan dalam pemanfaatan teknologi informasi secara positif dan berwawasan Al Islam Kemuhammadiyahan.; Menjalin kemitraan secara berkelanjutan dengan lembaga pendidikan dan stakeholder terkait.",
    "Program Studi Perencanaan Wilayah dan Kota di Fakultas Teknik UNISMUH. Prodi Perencanaan Wilayah dan Kota adalah program studi yang fokus pada pembelajaran perencanaan dan pengembangan wilayah serta kota, termasuk aspek-aspek seperti tata ruang, transportasi, lingkungan dan pengembangan ekonomi. Akreditasi: Baik, SK: 2023 Fasilitas: Laboratorium Perencanaan; Laboratorium GIS; Laboratorium Desain Kota Visi: Menjadi Pusat Program Studi Perencanaan Wilayah dan Kota yang unggul pada bidang penataan infrastruktur wilayah berwawasan lingkungan islami terkemuka, terpercaya, dan mandiri. Misi: Menyelenggarakan iklim akademik berwawasan Al Islam Kemuhammadiyahan.; Melaksanakan Penelitian dan pengabdian masyarakat pada bidang penataan infrastruktur wilayah berwawasan lingkungan.; Melaksanakan kerjasama kemitraan pada bidang akademik, penelitian dan pengabdian masyarakat.",
    "Organisasi mahasiswa di Fakultas Teknik UNISMUH: Teknik Sipil, Teknik Elektro, Informatika, Arsitektur, Perencanaan Wilayah dan Kota. Fungsi: Sebagai wadah mempererat solidaritas mahasiswa, meningkatkan keterampilan akademik dan non-akademik, menyelenggarakan kegiatan seminar, pelatihan, lomba ilmiah, dan pengabdian masyarakat.",
    "Kerjasama internasional Fakultas Teknik UNISMUH: Mitra: Universitas Teknologi Malaysia (UTM), Universitas Malaysia Kelantan (UMK). Kegiatan: Workshop Internasional Child-Friendly Environment (CFE) mencakup riset dan pengabdian masyarakat",
    "Pendidikan berbasis Islam di Fakultas Teknik UNISMUH: Fakultas Teknik menekankan pendidikan yang tidak hanya teknikal namun juga dilandasi nilai-nilai Islami dalam menghasilkan insinyur profesional yang berintegritas dan inovatif."
  ],
  "metadata": [
    {
      "source": "data_feb.json",
      "type": "basic_info",
      "fakultas": "Fakultas Ekonomi dan Bisnis",
      "doc_index": 0
    },
    {
      "source": "data_feb.json",
      "type": "leadership",
      "fakultas": "Fakultas Ekonomi dan Bisnis",
      "doc_index": 1
    },
    {
      "source": "data_feb.json",
      "type": "program_studi",
      "fakultas": "Fakultas Ekonomi dan Bisnis",
      "doc_index": 2,
      "extra_info": "S-1 Manajemen"
    },
    {
      "source": "data_feb.json",
      "type": "program_studi",
      "fakultas": "Fakultas Ekonomi dan Bisnis",
      "doc_index": 3,
      "extra_info": "S-1 Akuntansi"
    },
    {
      "source": "data_feb.json",
      "type": "program_studi",
      "fakultas": "Fakultas Ekonomi dan Bisnis",
      "doc_index": 4,
      "extra_info": "S-1 Ekonomi Pembangunan"
    },
    {
      "source": "data_feb.json",
      "type": "program_studi",
      "fakultas": "Fakultas Ekonomi dan Bisnis",
      "doc_index": 5,
      "extra_info": "S-1 Ekonomi Islam"
    },
    {
      "source": "data_feb.json",
      "type": "program_studi",
      "fakultas": "Fakultas Ekonomi dan Bisnis",
      "doc_index": 6,
      "extra_info": "D-3 Perpajakan"
    },
    {
      "source": "data_feb.json",
      "type": "organisasi",
      "fakultas": "Fakultas Ekonomi dan Bisnis",
      "doc_index": 7
    },
    {
      "source": "data_feb.json",
      "type": "pendidikan_islam",
      "fakultas": "Fakultas Ekonomi dan Bisnis",
      "doc_index": 8
    },
    {
      "source": "data_fkip.json",
      "type": "basic_info",
      "fakultas": "Fakultas Keguruan dan Ilmu Pendidikan (FKIP) Universitas Muhammadiyah Makassar",
      "doc_index": 0
    },
    {
      "source": "data_fkip.json",
      "type": "leadership",
      "fakultas": "Fakultas Keguruan dan Ilmu Pendidikan (FKIP) Universitas Muhammadiyah Makassar",
      "doc_index": 1
    },
    {
      "source": "data_fkip.json",
      "type": "program_studi",
      "fakultas": "Fakultas Keguruan dan Ilmu Pendidikan (FKIP) Universitas Muhammadiyah Makassar",
      "doc_index": 2,
      "extra_info": "Pendidikan Bahasa & Sastra Indonesia"
    },
    {
      "source": "data_fkip.json",
      "type": "program_studi",
      "fakultas": "Fakultas Keguruan dan Ilmu Pendidikan (FKIP) Universitas Muhammadiyah Makassar",
      "doc_index": 3,
      "extra_info": "Pendidikan Bahasa Inggris"
    },
    {
      "source": "data_fkip.json",
      "type": "program_studi",
      "fakultas": "Fakultas Keguruan dan Ilmu Pendidikan (FKIP) Universitas Muhammadiyah Makassar",
      "doc_index": 4,
      "extra_info": "Pendidikan Matematika"
    },
    {
      "source": "data_fkip.json",
      "type": "program_studi",
      "fakultas": "Fakultas Keguruan dan Ilmu Pendidikan (FKIP) Universitas Muhammadiyah Makassar",
      "doc_index": 5,
      "extra_info": "Pendidikan Guru Sekolah Dasar (PGSD)"
    },
    {
      "source": "data_fkip.json",
      "type": "program_studi",
      "fakultas": "Fakultas Keguruan dan Ilmu Pendidikan (FKIP) Universitas Muhammadiyah Makassar",
      "doc_index": 6,
      "extra_info": "Teknologi Pendidikan"
    },
    {
      "source": "data_fkip.json",
      "type": "program_studi",
      "fakultas": "Fakultas Keguruan dan Ilmu Pendidikan (FKIP) Universitas Muhammadiyah Makassar",
      "doc_index": 7,
      "extra_info": "Pendidikan Biologi"
    },
    {
      "source": "data_fkip.json",
      "type": "program_studi",
      "fakultas": "Fakultas Keguruan dan Ilmu Pendidikan (FKIP) Universitas Muhammadiyah Makassar",
      "doc_index": 8,
      "extra_info": "Pendidikan Pancasila dan Kewarganegaraan"
    },
    {
      "source": "data_fkip.json",
      "type": "program_studi",
      "fakultas": "Fakultas Keguruan dan Ilmu Pendidikan (FKIP) Universitas Muhammadiyah Makassar",
      "doc_index": 9,
      "extra_info": "Pendidikan Guru Pendidikan Anak Usia Dini (PG-PAUD)"
    },
    {
      "source": "data_fkip.json",
      "type": "program_studi",
      "fakultas": "Fakultas Keguruan dan Ilmu Pendidikan (FKIP) Universitas Muhammadiyah Makassar",
      "doc_index": 10,
      "extra_info": "Pendidikan Sosiologi"
    },
    {
      "source": "data_fkip.json",
      "type": "program_studi",
      "fakultas": "Fakultas Keguruan dan Ilmu Pendidikan (FKIP) Universitas Muhammadiyah Makassar",
      "doc_index": 11,
      "extra_info": "Pendidikan Fisika"
    },
    {
      "source": "data_fkip.json",
      "type": "program_studi",
      "fakultas": "Fakultas Keguruan dan Ilmu Pendidikan (FKIP) Universitas Muhammadiyah Makassar",
      "doc_index": 12,
      "extra_info": "Pendidikan Seni Rupa"
    },
    {
      "source": "data_fkip.json",
      "type": "organisasi",
      "fakultas": "Fakultas Keguruan dan Ilmu Pendidikan (FKIP) Universitas Muhammadiyah Makassar",
      "doc_index": 13
    },
    {
      "source": "data_fkip.json",
      "type": "pendidikan_islam",
      "fakultas": "Fakultas Keguruan dan Ilmu Pendidikan (FKIP) Universitas Muhammadiyah Makassar",
      "doc_index": 14
    },
    {
      "source": "data_ft.json",
      "type": "basic_info",
      "fakultas": "Fakultas Teknik UNISMUH",
      "doc_index": 0
    },
    {
      "source": "data_ft.json",
      "type": "leadership",
      "fakultas": "Fakultas Teknik UNISMUH",
      "doc_index": 1
    },
    {
      "source": "data_ft.json",
      "type": "program_studi",
      "fakultas": "Fakultas Teknik UNISMUH",
      "doc_index": 2,
      "extra_info": "Teknik Pengairan"
    },
    {
      "source": "data_ft.json",
      "type": "program_studi",
      "fakultas": "Fakultas Teknik UNISMUH",
      "doc_index": 3,
      "extra_info": "Teknik Elektro"
    },
    {
      "source": "data_ft.json",
      "type": "program_studi",
      "fakultas": "Fakultas Teknik UNISMUH",
      "doc_index": 4,
      "extra_info": "Arsitektur"
    },
    {
      "source": "data_ft.json",
      "type": "program_studi",
      "fakultas": "Fakultas Teknik UNISMUH",
      "doc_index": 5,
      "extra_info": "Informatika"
    },
    {
      "source": "data_ft.json",
      "type": "program_studi",
      "fakultas": "Fakultas Teknik UNISMUH",
      "doc_index": 6,
      "extra_info": "Perencanaan Wilayah dan Kota"
    },
    {
      "source": "data_ft.json",
      "type": "organisasi",
      "fakultas": "Fakultas Teknik UNISMUH",
      "doc_index": 7
    },
    {
      "source": "data_ft.json",
      "type": "kerjasama",
      "fakultas": "Fakultas Teknik UNISMUH",
      "doc_index": 8
    },
    {
      "source": "data_ft.json",
      "type": "pendidikan_islam",
      "fakultas": "Fakultas Teknik UNISMUH",
      "doc_index": 9
    }
  ],
  "embedding_dim": 768
}